<?php


//相手に自動返信メールを送るかどうか -- 送らない場合は0、送る場合は1にしてください。 --
//HTML側でメールアドレスの項目を必須にしている場合：0または1どちらでもよい。
//HTML側でメールアドレスの項目を任意にしている場合：必ず0にしてください。(この場合、自分のメールアドレスが差出人となり、自分にメールが来ます)
$reply_mail = 1;




//自分に届くメールの内容 -- EOMからEOM;までの間の文章を自分に合わせて変更してください。 --
$send_body = <<<EOM

メールフォームからお問い合わせがありました。
お問い合わせの内容は以下の通りです。

--------------------------------------------------------------------------

送信時刻：{$now}
名前：{$name_1}　{$name_2}
メールアドレス：{$mail_address}
郵便番号：{$postal}
住所：{$address_1}　{$address_2}
電話番号：{$phone}
ご希望の宿泊日時：{$day}
宿泊日数：{$numberofnight}
女性人数：{$female}
男性人数：{$male}
お部屋タイプ：{$roomtype}
駐車場のご利用：{$parking}
お問い合わせの内容：
{$message}

--------------------------------------------------------------------------

送信者のIPアドレス：{$_SERVER['REMOTE_ADDR']}
送信者のホスト名：{$_SERVER['REMOTE_HOST']}
送信者のブラウザ：{$_SERVER['HTTP_USER_AGENT']}

送信前の入力チェック：{$javascript_comment}
メールフォームのURL：{$now_url}
メールフォームに付く前のURL：{$before_url}

EOM;




//相手に届く自動返信メールの内容 -- EOMからEOM;までの間の文章を自分に合わせて変更してください。 --
$thanks_body = <<<EOM

この度は宿泊のご予約をいただき、ありがとうございました。
入力されたメールアドレスに自動返信メールが送られていますので、ご確認ください。

以下の内容で宿泊予約のお申し込みをお受けいたしました。

折り返しご連絡いたしますので少々お待ち下さい。

※24時間以上経っても連絡のない場合は、
お手数ですが再度ご連絡をお願いいたします。

----------------------------------------------------------------------------

送信時刻：{$now}
名前：{$name_1}　{$name_2}
メールアドレス：{$mail_address}
郵便番号：{$postal}
住所：{$address_1}　{$address_2}
電話番号：{$phone}
ご希望の宿泊日時：{$day}
宿泊日数：{$numberofnight}
女性人数：{$female}
男性人数：{$male}
お部屋タイプ：{$roomtype}
駐車場のご利用：{$parking}
お問い合わせの内容：
{$message}

----------------------------------------------------------------------------

※ご予約された「ふじや」は2016年6月より新たな住所となっておりますので
以前ご利用のあったお客様は住所の再確認をよろしくお願いいたします。
（以前の場所は姉妹店「Guesthouse Fujiya」となっております。）

ありがとうございました。

──────────────────────────────────────

　　ふじや　あつし
　　〒790-0842 愛媛県松山市道後湯町7-23
　　TEL : 080-1750-5454
　　Web Site URL : http://yado-fujiya.com/
　

──────────────────────────────────────

EOM;


